[
  {
    "id": 0,
    "conversation_amr": "(PERSON6) Hi, hello.\nCan you hear me?\n(PERSON2) Yes.\n(PERSON6) I do not hear anyone.\nI have to reconnect again.\nOr maybe can someone else, give it a try as well, because – \n(PERSON2) I can hear you.\n(PERSON6) [PERSON11], can you say something as well.\nBecause with [PERSON2], I remember that [PERSON2] also had some microphone issues at times.\n(PERSON2) And you can hear –\nyou cannot hear me or –\n(PERSON6) Yeah. \nSo.\nI'll try to reconnect.\nI'll –\nYeah –\nSo, [PERSON8].\nHello, can you say something?\n(PERSON8) Oh yeah.\nHi.\n(PERSON6) Oh, yeah.\nI. \nI have to reconnect.\nMaking [PERSON8] the host, for now.\nYeah. \nSo, I'll make [PERSON8] the host for now, and I reconnect. \nLeave meeting.\n(PERSON8) Oh, okay.\nI hear you, by the way.\nHello.\n(PERSON6) Yeah, yeah.\nNow I can hear it.\nSo, for some reason I have always to connect a few times until zoom starts sending also the sound to me.\nSo, <laugh/> \nIt's annoying.\nYeah.\nSo.\nI was in a call until the very last minute.\nSo, sorry that I didn't remind everybody to– to connect.\nAh and–\nAh, I'm happy to see that you are here.\nSo, let's start.\nAnd also my machine crashed in the meantime, so I had to, like, restart it.\nAnd now it's all, like, starting up.\nSo, so, I would like to start, maybe in the other order.\nIn the opposite order than last week.\nSo, [PERSON7], if you could start.\nYou were one of those –\n(PERSON1) So, you want to hear, what did I do?\n(PERSON6) Yeah. Yeah, yeah, yeah.\n(PERSON1) So. \nThe transcripts for check are almost done.\nAnd one– one transcriber of Germany's working.\nAnd she wants to do it alone, until December the 10th.\nAnd my mother is writing the question for the German subti– subtitle user study.\nAnd she – and she has some progress, and then– then she will move it to the spreadsheet, so we can get, her feedback and– and continue with that.\nAnd I started to write deliverables.\n(PERSON6) Okay, that's great. \nStarting to write de–\nThat's – \nThat's excellent.\nAh, I'm hopeful about [PERSON12], but I haven't heard from him back. \nAnd he is not on the call either.\nSo let's –\nfeel free to ping [PERSON12] –\nyourself as well.\nSo the more –\n(PERSON8) Okay.\n(PERSON6) The more – the more, we do, the better.\nGreat.\nYeah, then.\n(PERSON1) Can I ask [PERSON11] to do, the transcripts of –\n by German ASR for the German transcriber.\n(PERSON6) Yeah, yeah, that–\n(PERSON11) So –\nSo, I have just added the transcripts for the first 30 parts, and for the next ten parts, it's still running.\n(PERSON1) Okay.\n(PERSON11) But for some folders, for some reason, the audio format is wrong, so, something is wrongly –\nBasically, the big trade, or something is wrong.\nSo, some files are still –\nhave still weird output. \nBut – but for most folders, it should be already fine.\n(PERSON1) Okay, thanks.\n(PERSON6) Yeah, that's great.\nSo, ah, I support this, it's, it's, it's great that, ah, Dá-\n[PERSON7], you have thought of [PERSON11].\nAnd [PERSON11] now has the time.\nThere are other things where I was, thinking of [PERSON11] and that would be training of, empty systems, so that they do the shortening.\nSo if you, [PERSON11], had the time.\nObviously, there is no way we could do it for the next week.\nBut we should really have the system – ready for –\n(PERSON11) Mhm.\nI looked at the tutorial from, from, from the NLP was it?\n(PERSON6) For the upcoming sessions and I've asked <unintelligible/> demand because I've seen the (meme) project demo.\nThey do offline subtitling.\nSo, that's sli– slightly easier than what we do. \nThey still have the same segmentation issues and so on.\nBut, their mission translation is doing shortening simply because the data is shortening.\nAnd that's because their target size, is– are the subtitles which are created for the hearing-impaired.\nSo, there is like natural shortening in the data.\nIt'd be great if we could also locate some, such type of the data where there is some natural shortening happening.\nWe would– wou–\nWe would put it in the architecture.\n(PERSON11) Mhm. That's also possible.\nBut also, I looked at the, at the –\nTutorial from the, from the –\n(PERSON6) Yeah, it was <unintelligible/>.\n(PERSON11) Yes, <unintelligible/>.\n Actually, so –\nSo, all of our models, basically work with, with, yeah, sequence to sequence where we just process the entire –\ninput sentence.\nAnd, then, when we have the final, output from, from, from the entire input sentence, we, start, generating, but, the output sentence.\nBut, but, actually, so –\nThe people from –\nI think, it was <unintelligible/> actually.\nThey are doing it, so that they are just processing prefixes.\nSo they pre–\nprocess first key words as they, as they, give them into the input.\nAnd hen they generate the first word.\nAnd, and then, basically with every new token that they get.\nThey generate, the new – \none new token.\nSo, basically, it is much faster because you just generate one word at a time.\nAnd also, I think it –\nIt could be quite easy to implement the, shortening in this, in this model as well.\n(PERSON6) Yeah.\n(PERSON11) Because we can just stop generating after some time.\n(PERSON6) Yeah.\nSo, it would be shortening because we ran out of time, right? <laugh/> \n(PERSON11) Yes. \nSo basically we would just, call it like to –\nWe would just train it, so that it s–\nStops generating it after the –\nSome, some time.\nYeah.\nSo, so that could also work.\n(PERSON6)Yeah.\nSo they have talked to [PERSON9].\nOr [PERSON9] mentioned it in a call that is, [PERSON3] is not ready, has no, specific things, for speech translation.\nSo this  <unintelligible/> and other strategies are no longer <unintelligible/> [PERSON3].\n(PERSON11) Okay, okay, so we would have to implement this.\n(PERSON6)Yeah.\nAnd there is nobody –\nIn Edinburgh, who would have the time to do that.\nSo if you would have the time, then you are one possible candidate.\nAnd we actually don't have any other candidates.\nWhere maybe I thought that, that maybe some students of [PERSON1], I do not know if he is on the call already.\nBut that is also like very risky and like distant.\nSo it would be difficult, but, so that –\nThe only other possible candidate would be, [PERSON13], from the [PROJECT1].\nWho, like, works halfway in Prague and halfway in Brno.\nBut he is working on other things in [PERSON3].\nSo, I don't want to, like, to focus him too, too, much.\nSo –\n[PERSON11], Please, think about it.\nIf –\n(PERSON11) Okay, okay,bso right now I don't know if it is realistic, because I, I was just looking at the [PERSON3] <unintelligible/> some time ago.\nAnd, I saw, basically, like, yeah. \nIt's quite like, quite low level.\nIt's written in <unintelligible/>.\nSo, I don't know how, how hard it will be to change this.\n(PERSON6) Yeah.\n(PERSON11) But if I, I see that it is possible, if I understand what's going on in the code, then, yeah, I –\n(PERSON6) Yeah. \n(PERSON11) Will like, let you know, based on, yeah, what they thi–\n(PERSON6) Yeah. Thanks.\nSo let me check the –\nThis is so –\nSo poor.\nI would never use –\nSo, we have [PERSON2], [PERSON4] and [PERSON8] you here on the call further.\nSo now, from all of you, I would like to hear an update for the sessions, for next week.\nSo, one thing is the Monday seminar. \nThat should be done very easily, don't bother yourself with that much.\nBut I think that [PERSON4] should just like, click, click on s– some buttons and get the get the, vocabulary, expanded for that, right?\n(PERSON4) Well, yes –\nWill work on it tomorrow.\n(PERSON6) Yes, but then a lot of effort is to be put into – the preparation for the two setups.\nUm, for, [PROJECT2] and <unintelligible/>.\nAnd, [PERSON4] you mentioned that you don't have the webpage for [PROJECT2].\nIs that still true?\n(PERSON4) No.\nI fi– found it.\nAnd I, I just saw the programme for [PROJECT2], and I was checking the talks.\nAnd I am trying to, gather the data <unintelligible/>\nthe relevant from those parts that are mentioned in the programme.\n(PERSON6) So, could you mer-\nMaybe, per– perhaps –\nWell, oh, you are you away?\nSo, you are away the whole Friday?\nOr only at eleven?\n(PERSON4) I'm away from eleven to one. No, ten to twelve.\n(PERSON6)Ten to twelve.\nOkay, so in the afternoon, for example, in the Czech afternoon. \nYou are able to, to do something.\nSo, I would suggest if it's not too late for, for issue.\nAnd I guess it's not.\nThat, you could have a Zoom call again with the videos and –\nAnd to, to have a dry run of some past similar talks to [PROJECT2] talks. \nAnd see how uh that system works.\nAnd, at the same time, we can do the same thing with the <unintelligible/> for example.\nThe, the, Supreme Audit talks.\nSo they are in the elite, the death set.\nSo I will.\nWe have the the links, some or else, maybe–\n(PERSON4) I'm, I'm a bit afraid that the <unintelligible/> probably will not be prepared till tomorrow.\nBecause tomorrow I will be working on the Monday seminar model as well.\nSo I think we can run the dataset for Monday.\n(PERSON6) Yeah, well –\n(PERSON4) Is it too late?\n(PERSON6) The more tests we do, the better.\nSo, even if we do the test of, like, the two concurrent subtitlings without domain adaptation, it would be useful test.\n(PERSON4) Okay.\nFor sure.\n(PERSON6) So, ah, so, [PERSON8], if you could plan for tomorrow afternoon, so that –\n(PERSON8) Yeah, I'm planning to do that.\n(PERSON6) So there –\nIt will be two videos, played concurrently.\nSo that actually means that we need you to operate two machines.\nThat's another critical thing. <laugh/>\n(PERSON8) I can't op–\nI can operate two machines.\nI have two laptops at home.\nSo, I can do that, I guess.\n(PERSON6) Yes, but you need two local machines.\nYou need to unit ark, and one more machine with X to go.\n(PERSON8) I can use black bird. \n(PERSON6) Okay.\nYeah.\nSo Ark and blackbird, right?\nYeah.\nSo tomorrow in the afternoon, should we say, like one or two, Czech time.\nWhat is better for you?\n(PERSON8) Both is okay with me.\n(PERSON4) Both are good for me.\n(PERSON6) So I suggest that at one.\nCzech time.\nSo, like, Zoom Test for –\nTwo –\nYouTube videos at the same time.\nSo, [PERSON8], would the, two, presentations be ready to paragraph use ready?\n(PERSON8) So I got the access to, <unintelligible/>, my engage, last night, so it was pretty late in India.\nSo I didn't set up my account.\nThen, I will complete it today. \nBasically yesterday, I, worked with all the steps.\nSo, it should be easy for me to do that now.\nOh, it will be done today, I guess.\nYeah.\nSo tomorrow we are going –\n(PERSON6) There is, there is some chance that –\nAh, yeah.\nSo, and [PERSON6] will provide –\n[PERSON8], [PERSON8], setting up, two presentations.\nSo, and [PERSON4], [PERSON4] has been working on adaptation, for the two domains.\n[PERSON8] setting up to online text –\nTo paragraph setting.\nOn (quest plus) virtual machines, behind.\nAnd then, Friday, test time for two concurrent sessions.\nSo it will be arc plus blackbird.\nOne will follow (saw) video, one will follow.\nI will say CL video.\nSo [PERSON4], if you put, could put a link here.\nPlease add a link –\n[PERSON4] –\nAnd, I will put a link, [PERSON6] will put a link here.\nYeah, so this will be the two videos.\nWe will start them, and we will watch that.\nThe pipeline will be probably the very same.\nBut still, you should like, have it as two separate pipelines.\nAnd you must not mess it up. <laugh/>\nAnd later.\nAh, like later Friday, or on, in, on Monday.\nAh, the models will be updated with the, with the domain elected ones.\n(PERSON4) Yeah.\n(PERSON6) So, on Friday, use –\nTwo separate pipelines, but each running actually the same thing.\nUpdate the – each of the pipelines –\nEach of the pipelines on Monday for the two different domain adaptations.\nYeah, so that is, that.\nAnd I'm curious about the evaluation, the scores, so [PERSON8], you have mentioned that you are already doing some ASR.\n(PERSON8) Yeah, so, I am compiling some days, are tasked for that.\nBut I am, facing some issues.\nIt's basically that some videos are not, are not, some videos are not <unintelligible/> properly into a 16 cave format.\nSo I'm looking into that.\nSo [PERSON10] told me yesterday that there are some issues with some audio, and I have to do that manually if that does not happen.\n(PERSON6) Yeah.\nSo, this is essential–\nThis should be –\nWe should, we all should know like how to do it.\nIt should be part of the automatic evaluation of a leader test set, right?\n(PERSON8) It is, yeah, it is.\n(PERSON6) That is, that is not working properly.\n(PERSON8) Yeah.\nBut there are some audio files, where it, it gets converted to, the MP3 format.\nBut when you pass it to the (sound) system, or the (sound) system will not work on that.\n(PERSON6) Mhm.\nSo this is this is strange.\nAh, issues with some files –\nWith the –\nThe 16 c– format, converted from so –\nYeah, [PERSON8], seek for any help you can get.\nIf [PERSON10] can do that, then, please tell [PERSON10] to do it.\n(PERSON8) Yeah, he is here with me, to do do it.\nSo I am doing it today, but –\n(PERSON6) Yeah – \n(PERSON8) That, that takes a bit of time, because I need to figure out which one is the one which is are getting passes where they <unintelligible/>. \nSo once I know that I can keep a track of it, so, for future –\nOr actually, for future I would not.\nWould not need it, because once I have the web be file, I probably won't, won't need to do convert.\n(PERSON6) Well, this, this should be actually –\nCan you still hear me?\nThe sound quality is a little worse.\nSo this should really be done, all the time.\nSo every time we run this evaluation, it should be, run from scratch.\nSo, every time, there should be a fresh download of a <unintelligible/> and fresh conversion and a fresh evaluation.\n(PERSON8) Yeah.\nBut still, if I am keeping track of the files, which, are – need to be manually converted, so that I can write a script, and it could take care of at least the known ones.\nAnd of course, if we add some new files, I can see for that later.\n(PERSON6) Yeah.\nSo this is an important thing that we should have, like come across, or it is, a months ago.\nRemember, it is, is– since August that I've been telling you that, that we want to evaluate on a later test set.\nAnd, like every time, you, you all.\nIt is not just you, you personally, [PERSON8].\nThere were other things, obviously.\nBut like, every time, you thought about that, you thought that, well, this will be easy.\nWe will just run it.\nAnd only when you actually do it, you will see all the problems.\nSo this is known, common.\nIt is always like that.\nSo that's a message for everybody. \nBefore you try, you never know what would be the the problem.\nSo for example, the call that I had, that, there was, someone was interviewing me so they, they, they wanted to record the video.\nZoom never worked as badly for me as it, as it was today for the recording.\nSo before you do, you cannot say whether it will work or, or not.\nAnd here we are running on the, in the problems of conversion, of the, of the file formats.\nSo hopefully, we will be able to, like, quickly get the numbers.\nSo do you have any word error rates so far?\n(PERSON8) No, I have not processed it.\nSo [PERSON1] said that, once, they get the transcript, we will done it together.\nBecause he also has not thoroughly <unintelligible/> the system.\nSo he wanted to do it together.\n(PERSON6) Yeah, ye–\nAnd you have the –\n(PERSON8) And I'll have a call with –\n(PERSON6) Today.\n(PERSON8) Yes.\n(PERSON6) Yes, that is very important.\nSo [PERSON1] is going to be extremely busy, because he is organising some event, tomorrow and over the weekend.\nSo we, we must not rely on [PERSON1], so today is your last chance to get it running before the, the weekend.\nAnd then only from Monday onwards, probably he, he could help.\nSo that is that thing.\n(PERSON8) Yeah.\n(PERSON6) Than maybe, have also [PERSON10] on that call with [PERSON1]?\nIs that planned that way?\n(PERSON8) Um, not right now.\nI will ask [PERSON10] if he is available.\n(PERSON6) Please do.\nAnd, who else could be of any help there?\nSo, my only thinking, is of [PERSON11] who was able to simply come by and help immediately.\n(PERSON8) Well, in this –\nI do not think anything will be, any –\nI don't know.\nFor now, there are like a lot of things to run, but I'm also simplifying everything, so that, ah, we won't have –\nI think –\n(PERSON6) Yeah, okay.\nYeah, so let's hope it will all work out.\nSo, as soon as you have any numbers, please send them to me.\nJust, regardless how low or high the numbers are, this –\nJust receiving the numbers will be a big relief for me.\n(PERSON8) I will, at least for –\nI, at least for <unintelligible/> , I will send you the numbers today.\nYeah, so for for which data set, the –\n(PERSON8) It is a khanic admitted, that, it is the <unintelligible/> 2020, it's part of that.\n(PERSON6) Khan, Khan Academy?\nOk, it is just –\nI mispronounced it.\nSo probably, you know the correct pronunciation, and I do not recognise it.\nYeah.\nSo there is these (saw) files.\nAnd these are more important, because they reflect the domain that we have for the SG1 meeting.\nAnd there is the money dogs, and these are important for the, SL domain.\n(PERSON8) Yes, oh, okay, so, I, I, I will all the three.\n(PERSON6) Yeah, okay, great.\nYeah.\nAnd, so, I know that [PERSON4] is working on the adaptation for the two domains.\nWe'll do a Monday seminar, tomorrow, that we will like, one (shot) think.\nAnd, I'm very curious.\nSo, [PERSON4], are you taking a part in that call, with [PERSON1] as well?\n(PERSON4) No.\n(PERSON6) I think it is a, I think you – you also should, because, you should also evaluate, the –\nSo, I'm hoping that you will be able to have the multiple custom dictionaries in the, our system.\nThe dictionaries that come from [PERSON2], and that you will choose, which is the best, one. \nThat you will have some numbers to, to choose – which of the ASR systems should be used.\nWhich of the vocabulary should be used.\nAnd for that you need the evaluation.\nSo, whatever you see by, shown by [PERSON1], will be also useful for you.\nUnless you already know how to run SLTF.\n(PERSON4) No, I don't know yet.\nAnd, so, I think there are some things to discuss about the, the multiple dictionaries.\nI received your email yesterday with, the thing I was –\nI mentioned in the mail, that the (ASR) system without using people's pronunciation was better than the one used with people's generated pronunciations.\n(PERSON6) So, so, sorry, say it again, and be more precise.\nSo [PERSON2] sent this email with the four words, the Watson, IBM –\n(PERSON4) Yes.\nSo this <unintelligible/> was.\nSo, I sent the, files to [PERSON2], three (kinds) of IBM and three (kinds) of Watson.\n(PERSON6) Yeah.\nSo he sent me, the phonemes spoken in those files.\n(PERSON6) Yeah.\n(PERSON4) And so, since his model works on some ESL.\nAnd so he first recognised the words in the audio file, and then converted into phonemes and then sent it to me.\n(PERSON6) Yeah.\n(PERSON4) So there was –\nFor example, there was one file in which the word was for IBM.\nAnd so –\nThe ESL decoded it, as I think, four IBM, and so the phonemes were <unintelligible/>.\nSo in this way, he sent me the phonemes, and I added those pronunciations in my dictionary.\nAnd so the performance of de– description was exactly the same with the – without adding these pronunciations in their dictionaries.\nAnd the one, domain adaptation model, that I developed with my manual, pronunciations.\nThe perform is slightly better than, these models.\n(PERSON6) Okay, yeah.\nYeah, well, this is too small of a sample.\nAnd then I know that – [PERSON2] produced, the long, word list, right?\nAnd you have not tested that one yet.\n(PERSON4) Yes, there is, there is a phoneme to grapheme list. \n(PERSON6) Yes.\n(PERSON4) I do not –\nSo, or I'm confused.\nHow can I use it as it is?\nI think, that can be used by developing for some model, from forming the graphic model and then using it.\n(PERSON6) No, no, no.\nThis is –\nThis is exactly what you did with the Watson.\nSo, you just swap the columns.\n(PERSON4) Okay, okay.\n(PERSON6) So you just convert the, the international phonetic alphabet into the phonemes, that, that CMU knows.\n(PERSON4) So it means that, that the list should contain Watson.\n(PERSON6) Well, I don't know if the list contains Watson, but it's –\n(PERSON4) <unintelligible/>\nBut I mean, it assumed that the list should contain our words –\n(PERSON6) Yes.\nYeah, yeah.\nAnd then, I agree that there is a lot of noise in this dictionary.\nSo, the thing that I asked for, is that you would have various versions of this dictionary by taking only the words that were observed, five times.\nAnd only the pronunciations that were observed three times or more, or something like that.\nSo, that way, these random errors, such as the example with this four IBM instead of IBM.\nThis will be not so frequent.\nBut still, you will have the variants in pronunciation, because if the person, says this alzo, if you remember, if he says this alzo with Z 20 times in the in the talk, then you will see that in the data with the Z.\nAnd if he sometimes manages to say correctly also, then yeah, again, you will see that in the data.\nSo, I would like, [PERSON4] to be in touch with [PERSON2].\nMaybe you continue on call, right?\nI have to –\nI, I will have to leave now, because I need to give the kids, the, the, the lunch and so on.\nBut please stay on this call and figure out jointly how to use that dictionary.\nSo [PERSON4], please show to [PERSON2] what is the dictionary that the system is accepting.\nShare your screen, and, and show it.\nAnd [PERSON2], please, have a look at that and help with converting the dictionary that you emitted to that file.\nOne thing that will be still needed, is the, language model substitute.\nBut all these words, should be like the known words.\nSo [PERSON4], you need to figure out what words are in the – in the language model.\nAnd the words which are in the language model, should be simply copied.\nSo the, the dictionary will have three columns.\nThe grapheme, as it is output.\nOne recognised.\nThe phonemes, as [PERSON2] proposed.\nAnd there will be multiple lines with different phoneme variations.\nAnd the third column, that will be also the same again for all of those, and there will be, again, the same grapheme form.\nSo that is when the language model sees.\nAnd I think that this way, the– these systems should be able to load it.\nAnd you will also possibly run into one more problem, that is not ready for two big custom dictionaries.\nSo this is also something that has to be tested, but please test it, the you two together.\nSo [PERSON2] knows what he created in the dictionary.\nAnd you know what the dictionary looks like, when you are creating it manually, and you need to put these two knowledges– \n<laugh/>\nPieces of knowledge together.\nAh, so that it works with the, with the generated dictionary.\n(PERSON4) Okay, okay.\n(PERSON6) So [PERSON2], does this make sense?\n(PERSON2) Yeah, sure, we'll discuss it.\n(PERSON6) Yeah, so is there anything else, [PERSON2], that you – that you have?\n(PERSON2) Well, maybe, maybe interesting information for Dominik.\nI'm finishing training of a German ASR that may be used for, for time stamping.\nI'm not sure, how, good it will be because I'm trying to do it on (Libry) Speech.\nAnd although, when I was downloading, it, they claimed it has more than 600 hours.\nBut then the training said that the actual training set contains only around 300 hours.\nAnd I'm still not sure whether this 300 hours does not contain, similar sentences.\nOr actually the same sentences, but spoken by, by, by different speakers.\nYeah, so it's, it is, because, well –\nFor example, in English or Czech I was used to, used to observe more steep conversions.\nAnd now it – now it, won't convert so fast.\nSo, if, if I'm a –\nI, take, some samples of – during the training.\nThen there are some, still some, serious errors in the ASR output.\nSo, so, maybe, I'm, I'm hopeful that for, for the time stamping, it is good enough.\nOr at least we, we might try it.\n(PERSON1) Okay, sure.\nAnd is it possible to enrich the language model by texts, because we have lots of relevant texts from your parliament.\n(PERSON2) Oh well, for, for the decoding.\nI, my views also language model. \nWell, it depends on what we want to do.\nIf we want to just infer like, like (open) transcripts, then we can, we can use the language model.\nAnd we can, we can also get, get the time stamps for, for, for the transcript.\nIf, if you have transcript, and we want just, want to do just a time stamping then there is no way how we can use the language model.\n(PERSON1) Yes, I –\nWe may need both.\nTranscripts for <unintelligible/> set.\nOr, I mean, forced alignment for the (fantast) set.\nAnd then reco–\nRecognition for, for the rest.\nFor around a 100 hours.\n(PERSON2) Well, there are for the recognition, there is possibility to use language model.\n(PERSON1) Yeah.\n(PERSON6) Yeah, thanks for the progress.\nPlease discuss this separately.\nI just – because I really have to leave.\nI would like [PERSON4] to stay on the call with [PERSON2], right?\nAnd discuss how to use the dictionary.\nAnd I see [PERSON10] here.\nSo [PERSON10], how much time do you have in the coming days?\n(PERSON10) It actually depends on what day are we asking, like, I have some presentations to make an assignments are piling up.\n(PERSON6) Yeah.\nSo, well there is a lot of things that [PERSON8] needs to do.\nAnd I think it would be good if you two would like split it among yourselves so that [PERSON8] can manage that in time.\nSo there is this, the scoring, some meeting with [PERSON1] this afternoon.\nSo I think you should really join that as well.\n(PERSON10) Okay –[PERSON4]\n(PERSON6) Because this is the numbers that we want to obtain for the different models.\nAnd then [PERSON8] needs to prepare to have the double system running.\nWe will do first test of this tomorrow at 1 Prague time.\nSo I think that if you, [PERSON10], focused more on getting the numbers, and [PERSON8] focus more on getting these systems running, then it would –\nThen we will reach the the goals.\n(PERSON10) Okay, makes sense, all right.\n(PERSON6) So please discuss this separately to find the time, I don't know the meeting time for, with [PERSON1].\nAnd, yeah –\nBut I really want to see the numbers.\nSo I would like to have the ASR numbers, today.\nAnd improved numbers on Monday, when [PERSON4] has the domain adaptation for those.\nAnd then we will, on Monday, decide which of the models to use.\nAnd we can still move Monday to Tuesday, but Tuesday is already the [PROJECT2] day.\nSo the, the CL decision really has to happen on Monday.\nAnd we need at least two numbers to compare <laugh/>.\nSo, get one number the baselines now and the – the improved on Monday.\n(PERSON10) Okay, okay.\n(PERSON6) Okay, so I'm leaving at the moment.\nAnd if it, asks me to know.\nNow, [PERSON8] is the host, so that is that is good.\nAs long as the [PERSON8] is on the call –\nLike you, the call can run.\nSo please, [PERSON4] and [PERSON2], synchronise and [PERSON10] follow that as well.\nAnd [PERSON8], and you synchronise –\nAnd get the numbers and send any numbers to me today.\nSo as, as a baseline.\nSo thanks and sorry for taking more time.\nAnd fingers crossed for – for all the, for these tests.\nThanks.\nAll right.\n(PERSON8) [PERSON10], I'll send you a text on Slack later or –\n(PERSON10) Yes.\n(PERSON8) So later today.\nBecause, I was mentioned by you on the call, call yesterday, or the day before yesterday.\nI tried processing it but I think some of the files, even in khanic (terminators) are, are (those) files, which doesn't get converted into 16 <unintelligible/> format pretty easily.\n(PERSON10) Okay, that is not, not a big issue.\nBut I'll take care of it again.\nSo, are we discussing anything else? \nI would stay in the call but I see silence, so –\n(PERSON7) By the way, what do you want compare, [PERSON8]?\nAll the workers and their quality and latency?\n(PERSON8) actually mostly about the –\nIt is basically about the error rates in (multitranslation) and the ASR?\n(PERSON1) Yes, I think we have only one option for ASR, don't we?\nOnly one ASR, or there are two?\n(PERSON8) Sorry?\n(PERSON1) How many ASR workers do we have?\n(PERSON8) Right now.\nOne is from (K80).\nOne is what we use for our Monday Seminars.\nThat's two.\nAh, even with (K80), we have two.\nAh, one is the (nearest) one – \n(PERSON1) Okay.\n(PERSON8) Sequence to sequence, the other one is a normal one.\n(PERSON1) Yeah.\n(PERSON8) And in the Monday Seminar one, [PERSON4] is going, do the <unintelligible/> adaptation.\nFor –\nFor – both the different tasks.\nAnd, finally, on Monday, we'll see, or which model performs best.\n(PERSON1) Yes.\nWhen I did the comparison of the workers for <unintelligible/> SLT.\nThen I observed that, that there are no big differences in machine translation parts.\nBut the, the bottleneck in quality, was the ASR quality.\nSo you may select the best ASR worker in quality.\nAnd then, then, then pick the (MT) worker with the lowest latency and, and some good flicker.\nAnd latency and flicker may test quite, quite easily, on one document.\nAnd not, not, on the whole test set.\n(PERSON8) Yes.\n(PERSON10) I also –\nDuring the month of August, we also had numbers for the (MT) models.\nWhere –\nWhat do I say, the rainbow (MT) models.\nScores were better than our, our –\nI think, yeah, maybe <unintelligible/> or [PERSON11] –\n(PERSON8) It was [PERSON3].\n(PERSON10) You just, <unintelligible/> [PERSON3]?\n(PERSON8) Think so.\n(PERSON10) I'm not sure.\nNo, I, you –\nI think you were not there, at that moment so –\nYou may not know about it.\n(PERSON8) I have the school so –\n(PERSON10) Okay, you have this (course), so –\nSo –\nActually, [PERSON5] compared this course between –\nI think, it was rainbow and, summer set of workers.\nAnd rainbows set – a set of  rainbow workers were better.\nI think it was [PERSON11]'s, two, 43 to 43 languages.\nAnd that were kind of –\nThey had like little lesser scores, I mean –\nRainbow workers had better scores, in, in short, yeah.\n(PERSON8) Okay, basically.\nWhat on the remission on the call is divorced to use individual translation workers.\nYou can see if they are performing better.\nSo uh if not, then obviously we can fall back to, to the rainbow.\n(PERSON8) Okay, so I'll make [PERSON4] the host now, because I will go and have my lunch.\nIt is pretty late here, and I did had my lunch.\n(PERSON4) <unintelligible/>\n(PERSON10) Thank you, bye, bye. \nAnd text me on Slack in the weekend.\n(PERSON1) Yeah, bye.\n(PERSON11) Okay, [PERSON7].\nOkay, I am –\n(PERSON8) Bye.\n(PERSON11) I am just – trying to commit it.\nBut – so okay.\nI have it in the good format now, but I just – because I'm just checking the folders.\nAnd for some folders, the output is like totally terrible.\nI don't know why is this.\n(PERSON1) Okay.\n(PERSON11) But for some folders, it is okay, for some it's terrible.\nLike all the words are some, just –\n(PERSON1) It may be caused by the speaker.\nMaybe he doesn't speak clearly for the ASR.\n(PERSON11) Because, like, it is just like the, most common words in the language, I would say, which are, which are recognised over and over.\nLike half of the world is like (aber).\n(PERSON1) <laugh/>\nYeah.\nIt may happen.\nMaybe you can, if you want to inspect it, then listen to the to the, to the source audio, and you will see.\nThis is yeah, and it.\n(PERSON11) Yeah, I'm trying to do this, yes.\n(PERSON1) And it doesn't matter if, if we miss some, some, me of them.\nAnd the annotator will –\nCan and filter them out, by herself.\nWe can keep them there –\n(PERSON11) Because like for the first files it worked.\nAnd now I have files with (Czech) names.\nAnd fo– for this, it is working quite bad.\nSo, yeah, it could be this.\n(PERSON1) Yeah. \n(PERSON11) I'm just going to check it once more, and then I will push it.\n(PERSON1) Great.\nAnd it will be good to commit or to save the, to –\n(PERSON11) <unintelligible/>\nI'd say it's probably not the speaker, but it's the files, because often for the files.\nLike when I converted them even to the right format.\nIt just told me like (FFMPEG) again told me that, that there were wrong time stamps in the file, whatever that means.\nAnd basically, the – so – the yes –\nSo, so I, I now see that the transcripts for, for these files are – don't have the right length.\nSo they were processed incorrectly.\nAnd I'm not sure how, how to convert them properly, because (FFMPEG) just returns an error for those files, so –\nYeah, but it does not support the format, actually.\n(PERSON1) You may try (sox).\n(PERSON11) Yeah, but it doesn't support the format, actually.\n(PERSON1) Which for– format, is it? (OGG)?\n(PERSON11) It is–\nYes, it's actually O–\nAh, wait.\nThen it should –\nI don't know why I didn't.\nI will try it once more.\nOkay, yeah, I will, I will.\nThen I really use (soxi), okay.\nI don't know what was actually the problem.\nOkay, yeah.\nBecause, because for most of the folders that I transcribed later, there's this problem, that basically –\nThe length is incorrect.\nOh, okay, so I will change this to (soxi)?\nAnd actually, how many, how many work– workers can I run in parallel on CPU?\nIs it like – can I run, let's say 100?\n(PERSON1) On, on one machine, or?\n(PERSON11) I don't know, like on anywhere.\n(PERSON1) Or in (Q) to (F), you can run 100.\n(PERSON11) Okay, be- because right now –\n(PERSON1) <unintelligible/> or –\n(PERSON11) Yeah.\nBecause I think that right now the best way is to throw away everything and to run everything in parallel, so that like in one hour everything would be done.\n(PERSON1) Yes.\nNo, no, no, no problem.\n(PERSON11) Because, because like now, I think for m– maybe half of the files it would be, you know, like totally wrong.\nAnd that would like confuse everyone, a- and I can't really find which files it is, be–\n(PERSON1) Yes.\n(PERSON11) Because it's a lot of files.\nSo I would have to open everything now, or <unintelligible/>.\n(PERSON1) Yeah.\n(PERSON11) So maybe I'll just change the converting –\nOkay.\n(PERSON1) And the converting command is called sox.\nS, O, X.\nS, O, X, I is another commanded.\nIt gives you only information.\nAnd you may google of the format of the conversion– for the conversion.\n(PERSON11) Sorry.\nI accidentally refreshed –\nOkay, I will try it for one file if it works better.\nFor this guy called (strejček).\n(PERSON1) [PERSON2], are you still here?\n(PERSON2) Yeah\n(PERSON1) And how much time do you have to work on the German ASR? Can we –\nCan we, or should we go forward with the language models to process the interpreters?\n(PERSON2) Like you would like to train a language model. \n(PERSON1) Yes or –\n(PERSON2) well –\n I am – continuously saving checkpoints so I can already run the ASR.\nSo if you provide me a la– language model, then I –\n(PERSON1) I can only provide you the texts.\nThe monolingual German text.\nThe –\nIn the European domain.\nAnd so it will be in domain.\nAnd then I hope there will be good quality for the recognition.\n(PERSON2) Well, one more thing.\nMy ASR is – lowercase.\nis it okay for you?\n(PERSON1) Yes.\n(PERSON2) Okay. \nAnd without punctuation also.\n(PERSON1) Yes, we don't –\n(PERSON2) Okay.\n(PERSON1) We don't care, so far.\n(PERSON2) Right.\nThen you can provide me with it.\nI'm not sure whether I, I, get it done by today, but –\n(PERSON1) No problem.\n(PERSON2) Tomorrow, I think it could be done.\n(PERSON1) Yeah. \n(PERSON11) Okay, yeah, one more thing.\nSo I figured out that actually, in the – in some of the files, there is –\nYou don't just hear the interpreter, but you also hear the person saying something in English in the background.\nSo maybe that could also be the problem.\nThe speaking of the wrong person, actually.\n(PERSON1) Yeah, only – only at the beginning or during the whole –\n(PERSON11) Everywhere.\nThat is the thing, everywhere.\n(PERSON1) Yeah.\n(PERSON11) But, so, if it does work now, then okay.\nIf it doesn't work, then I can apply some kind of filter to cut off the –\nThis effort with with low volume, maybe.\n(PERSON1) It's, it's okay or –\n(PERSON11) Okay, I will just try how it works.\n(PERSON1) Or we can ask the, the annotator, whether the transcription work helped, to spare the – her time.\nAnd, if she says that not, even when the quality is good, then, then we don't need to care much about the rest.\n(PERSON11) Okay.\n(PERSON1) And we are the focus on [PERSON2]'s high quality on, on the others. \n(PERSON4) [PERSON2], we may discuss now?\n(PERSON2) Fine.\n(PERSON4) Now, we discuss, no?\nOr some thi– <unintelligible/>, [PERSON7]?\n(PERSON1) No, I, I think we are done.\nI will send an email to [PERSON2].\n(PERSON4) Okay, thank you.\n(PERSON1) And I may disconnect this call.\nSo see you.\n(PERSON2) Bye.\n(PERSON4) So, if I am sharing my screen, just a minute.\n I think can you see my screen?\n(PERSON2) Yes.\n(PERSON4) So, actually, this is the format of dictionary that is used by the ASR. \nAnd, the, so first one is the word.\nAnd the next is the pronunciation of the word and – \n(PERSON2) And –\nThis, this (curly) brackets, wha–\n(PERSON4) I actually do not know why is this here.\nBut there are the (curly) brackets around the pronunciation and be (curly) brackets around first and the last phoneme WB in there.\n(PERSON2) And, and that some special mark, or, or –\n(PERSON4) Which one?\n(PERSON2) The WB.\n(PERSON4) Yes, this is, this is, I don't know.\nProbably the, the requirement of the two kit.\nSo it is WB for all the words.\n(PERSON2) Okay, okay.\n(PERSON4) It is the right before starting and ending phoneme.\nAnd even if – this is not there, I think it is not a big issue for me to append.\nBut the problem is, so this is the, CMU dictionary.\nAnd it is actually, is in at public format.\nSo I think you can find that, over, on Wikipedia, as well.\nBy this alphabet.\n(PERSON2) Yeah.\nSo it appeared to two, two letter.\n<unintelligible/> is also available on there.\nAnd I – there is a – I under–\nThey found a package of our language, which, which automatically converts the IP to alphabet the other way around.\nSo that can be converted easily but the problem is, that, there a– phonemes, there are some IP formats that are not in alphabet.\nJust let–\nThis –\nI couldn't –\n(PERSON2) Okay.\n(PERSON4) That wasn't converted by s–\nThis is the email window.\nAnd so, there was - were some phonemes that were not converted into the alphabet phonemes. \nAnd, so, I am afraid that when I will be processing this list of graph–\nList of graphemes to phonemes, so probably there will be some issues regarding the, such phonemes.\nSo if –\nI can share the other package with you, if, if you are familiar with that.\nIt is very easy to use.\nVarious manual is also available for that package, so –\nYou can use that package as well. \nOr in any way, if you would convert these – this IPA a into alphabet phonemes that would be great for me.\nIs it possible?\n(PERSON2) I can, take a look, at the –\nWell, I have a – \nSend you some link once.\nBut I'm not sure where it was.\nWas it done –\nIt was on (Skype), I guess. \nI found some dictionary.\n(PERSON4) Is it –\nBut I think –\n(PERSON2) CMU to IPI and –\nWell, this strange A, you mentioned.\nCan you copy the, the, the letter to chat please?\n(PERSON4)  And just let me –\n(PERSON2) There it is.\n(PERSON4) There was another, as well, but I –\nI don't remember with one it was exactly.\n(PERSON4) Se– send another one.\n(PERSON2) It seems that, there is no –\nWell, maybe we could replace this phoneme with some other one.\nBecause actually, we want t, we want to – produce some a– variable pronunciation. \nSo actually, actually.\nIt's okay if we substitute, substitute it.\nI don't know how to copy this, but, if–\nThere is some nice chart in, in Wikipedia, that shows you the nearest, nearest phonemes to this one. \nAnd the nearest one are, for example. you did – the link.\nThese two or this one.\nThese three, so we can, just, so we can just, copy.\nWe can just substitute each word with this phoneme.\nWith two other words, with both, or, or three other versions of that word with using these three, this three phonemes?\n(PERSON4) Can you share the link of Wikipedia please?\nBecause I think there may be some further phonemes problems.\nSo you with that I would be okay.\n(PERSON2) If you go to the vowels paragraph, then there is some mapping or some map of how, which phonemes are actually near, and which are more, far apart.\n(PERSON4) Are you talking about this chart?\n(PERSON2) Can you open it in your window, because I'm still seeing your (common line).\nYeah, yeah, this one.\nYeah.\n(PERSON4) I don't know the pronunciation of any of this.\n(PERSON2) Sorry?\n(PERSON4) I don't know the pronunciation of any of these vowels.\nSo are they actually near when they are spoken, or?\n(PERSON2) I, I guess that they are so –\nIf – no – just open them.\nThere should be some –\nThere should be some examples.\nFor example, for the open-mid, the central open-mid, the first, first IPA phoneme.\nIf if you click on it, then, for example, it's not bird like bird.\nLike the flying, flying animal, a bird.\nAnd there's this example.\nAnd if we go for, for, for the letter, we do not have in in CMU.\nAnd there is an example like a nut, nut, bird, nut.\nOr –\n(PERSON4) That's right, <unintelligible/>\nI will see it then –\n(PERSON2) Or maybe –\nAnd it's in which word in our dictionary?\nIt is in –\nWhere it is?\nI am blind.\nWhere did you find this?\nThis rotated A.\n(PERSON4) I think –\nIt is IPM, it is m.\nI think the better example is this third E in Watson.\n(PERSON2) I do not see it there.\n(PERSON4) It's, it's –\n(PERSON2) It's the E.\n(PERSON4) Yes, it is a Watson, son and som here.\nWell, I guess that's quite near.\nM and en, what son.\nMaybe, I'm well somehow, if you pronounce it and pronounce it incorrectly.\nWell, Sorry, sure I need to go, because I have another meeting.\nAnd I. I need to prepare myself.\nSo  please, please.\nUm, let us have a call tomorrow, have, have –\nAre you free, free tomorrow?\nI'm.\nFor example, let's say, Where is my calendar?\n(PERSON4) I think probably it will be difficult to have a call tomorrow.\nI will let you know an email or Slack, because tomorrow I am off for Friday prayer on Friday for 10 to 12.\nAnd then we have a test run with [PERSON8] that we were discussing.\n(PERSON2) Okay, yeah, sure.\n(PERSON4) I think it will be difficult tomorrow.\n(PERSON2) Let's just –\nPlease just a write me what do you need from me, if you need from me to, to remap my dictionary to CMU, well, I can definitely do that.\nSo is it what you need?\n(PERSON4)  Yes, if, if that can be done, it would be very great. \nBecause I can do that, but I'm <unintelligible/> too many adaptation models.\nAnd so if you have time and you are not too busy.\nSo, if you have time and you are not too busy, it would be great if you can do it.\n(PERSON2) Well, okay, I can do that.\n(PERSON4) If you could just convert this list into the CMU phonemes.\nSo that, that would be IPA rather than (IP).\nThere will be the phonemes of alphabet.\n(PERSON2) Sorry, once again, please?\n(PERSON4) I'm saying that if you could just change these IPS to the alphabet phonemes, that would be great.\n(PERSON2) To the <unintelligible/>, you mean?\n(PERSON4) Yeah.\n(PERSON2) Yeah, sure. \nSure thing, okay.\nI will, will be in touch with you, probably tomorrow.\nBye.\n(PERSON4) Thank you, bye.\n[PERSON11], can I just end  the meeting?",
    "summary_text": "- Meeting began with connection issues and making PERSON8 the host temporarily.\n- PERSON1 reported progress on transcripts, German transcriber working alone until December 10th, and mother writing questions for German subtitle user study.\n- PERSON11 added transcripts for first 30 parts, working on next 10 parts, some audio format issues.\n- Discussed possibility of training empty systems for shortening, but unsure if realistic due to low-level code.\n- Preparation for two setups for PROJECT2 and another project discussed, with gathering data and working on Monday seminar model.\n- Plan for Friday afternoon: test two concurrent subtitlings without domain adaptation, using two laptops and two local machines (Ark and Blackbird).\n- PERSON8 to set up two presentations for paragraph setting on virtual machines.\n- Friday test time for two concurrent sessions, one following a \"saw\" video and one following a \"CL\" video.\n- Two separate pipelines will be used, each running the same thing, and updated with domain-adapted models later on Friday or Monday.\n- The team is working on domain adaptations and ASR evaluation, but facing issues with video conversion and audio file formats.\n- [PERSON8] is working on resolving the issues and will seek help from [PERSON10] if needed.\n- [PERSON6] emphasizes the importance of running evaluations from scratch every time to identify potential problems.\n- [PERSON4] is working on adaptation for two domains and will participate in a call with [PERSON1] to learn about evaluation.\n- [PERSON2] has provided phonemes for custom dictionaries, but [PERSON4] found that performance was similar with and without them.\n- [PERSON6] suggests using [PERSON2]'s longer word list and filtering it to reduce noise and improve performance.\n- [PERSON4] and [PERSON2] will work together to convert the generated dictionary into a format that the system can accept.\n- [PERSON2] is finishing training a German ASR for time stamping but is unsure of its quality due to a smaller training set and potential duplicate sentences.\n- Discussed enriching the language model with relevant texts from parliament for decoding\n- Considered using transcripts and forced alignment for different sets, and recognition for around 100 hours\n- Discussed splitting tasks between team members to manage workload and reach goals\n- Aim to obtain ASR numbers today and improved numbers on Monday, then decide which models to use\n- Discussed potential issues with file formats and conversion, suggested trying sox for conversion\n- Discussed training a language model for German ASR, considering lowercase and without punctuation\n- Noted that some files contain both interpreter and original speaker audio, which may cause issues\n- The team discussed potential issues with the wrong person speaking during the project.\n- They considered applying a filter to cut off low volume efforts if the problem persists.\n- Person1 will send an email to Person2 and focus on high-quality work from others.\n- Person4 and Person2 discussed the format of the dictionary used by the ASR, including word pronunciation and special marks.\n- They talked about converting IPA to alphabet phonemes and potential issues with certain phonemes not being in the alphabet.\n- Person2 suggested substituting problematic phonemes with similar ones to produce variable pronunciation.\n- They looked at a Wikipedia chart to determine which phonemes are near each other in pronunciation.\n- Person2 agreed to remap their dictionary to CMU and convert the list into alphabet phonemes.\n- Person4 and Person2 will be in touch tomorrow to discuss further.\n- The meeting ended with Person4 asking Person11 if they can end the meeting."
  }
]